a = []
sum = 0
while True:
    b = input('มินตันสโตร์\n apple(ลด20%) [a]\n oppo(ลด25%) [o]\n samsung(ลด40%) [s]\n ตะกร้า[x]\n ออก[end]')
    b = b.lower()
    if b == 'a':
        c = input('เลือกรุ่น\n iphone7 ราคา12,000 [1]\n iphone x ราคา25000 [2]\n iphone 11 ราคา33000 [3]\n') 
        if c == '1':
            a.append('iphone7:12000:2400:9600')
            print("\n*******เข้าระบบแล้ว*******")
            g= int(9600)
            sum+=g
        elif c == '2':
            a.append('iphonex:25000:5000:20000')
            print("\n*******เข้าระบบแล้ว*******")
            g= int(20000)
            sum+=g
        elif c == '3':
            a.append('iphone 11:33000:6600:26400')
            print("\n*******เข้าระบบแล้ว*******")
            g= int(26400)
            sum+=g
    elif b == 'o':
        c = input('เลือกรุ่น\n A5S ราคา5900 [1]\n Y53 ราคา8500 [2]\n Z5 ราคา13000 [3]\n') 
        if c == '1':
            a.append("A5S:5900:1475:4425")
            print("\n*******เข้าระบบแล้ว*******")
            g= int(4425)
            sum+=g
        elif c == '2':
            a.append("Y53:8500:2125:6375")
            print("\n*******เข้าระบบแล้ว*******")
            g= int(6375)
            sum+=g
        elif c == '3':
            a.append("Z5:13000:3250:9750")
            print("\n*******เข้าระบบแล้ว*******")
            g= int(9750)
            sum+=g
    elif b == 's':
        c = input('เลือกรุ่น\n s10 ราคา34000[1]\n note10 ราคา29000[2]\n tab s ราคา28900 [3]\n')
        if c == '1':
            a.append("s10:34000:13600:20400")
            print("\n*******เข้าระบบแล้ว*******")
            g= int(20400)
            sum+=g
        elif c == '2':
            a.append("note10:29000:11600:17400")
            print("\n*******เข้าระบบแล้ว*******")
            g= int(17400)
            sum+=g
        elif c == '3':
            a.append("tab s:28900:11560:17340")
            print("\n*******เข้าระบบแล้ว*******")
            g= int(17340)
            sum+=g
    elif b == 'x':
        print('------------------------------------------')
        print('{0:<15}{1:<12}{2:<12}{3:<12}'.format('สินค้า','ราคา','ส่วนลด','จ่ายจริง'))
        print('------------------------------------------')
        count = 0
        for d in a:
            f = d.split(":")
            count+=1
            print(count,end=") ")
            print('{0[0]:<12}{0[1]:<12}{0[2]:<12}{0[3]:<12}'.format(f))
            continue
        print('------------------------------------------')
        print("รวมเป็นเงินทั้งหมด                        ",sum)
        print('------------------------------------------')
    elif b== "end":
        exit()
